{
    "pageContent": {
      "text": "Explore\nDecide\nApply\nWishlist\nChat\nSign in\nUniversity of Cambridge\nHome Countries United Kingdom University of Cambridge\n4.3\n55\nRead 50 reviews\n Multiple locations\nWith more than 18,000 students from all walks of life and all corners of the world, nearly 9,000 staff, 31 Colleges and 150 Departments, Faculties, Schools and other institutions, no two days are ever the same at the University of Cambridge.\n#4\nRanking\n182\nMasters\n71\nScholarships\n1,773\nAcademic Staff\n19,681\nStudents\n7,676\nStudents (int'l)\n9,250\nStudents (female)\nPublic\nInstitution Type\nMaster's Programmes\nSocial Sciences\nHumanities\nNatural Sciences & Mathematics\nMedicine & Health\nEducation & Training\nEngineering & Technology\nBusiness & Management\nArts, Design & Architecture\nEnvironmental Studies & Earth Sciences\nComputer Science & IT\nApplied Sciences & Professions\nJournalism & Media\nAfrican Studies\nM.Phil. / Full-time / On campus\nUniversity of Cambridge\nCambridge, United Kingdom\n11,305,204 PKR / year\n9 months\nAnglo-Saxon, Norse and Celtic\nM.Phil. / Full-time / On campus\nUniversity of Cambridge\nCambridge, United Kingdom\n11,305,204 PKR / year\n9 months\nArchaeological Research\nM.Phil. / Full-time / On campus\nUniversity of Cambridge\nCambridge, United Kingdom\n12,154,691 PKR / year\n10 months\nArchaeological Science\nM.Phil. / Full-time / On campus\nUniversity of Cambridge\nCambridge, United Kingdom\n11,305,204 PKR / year\n10 months\nShow more programmes\nWhat students do after studying at University of Cambridge\nAll Disciplines\n\nThis information is based on LinkedIn alumni data for graduates from 2018 to 2024 and may not fully represent all career outcomes\n\nTotal alumni\n37,386\nWhat they do\nWhere they work\nWhat they do\nBusiness Development\n17%\n6533\nEducation\n12%\n4642\nFinance\n9%\n3542\nOperations\n9%\n3320\nResearch\n7%\n2745\nOther\n44%\n16604\nRegister to view full breakdown\nHistory\n\nThe University of Cambridge is rich in history - its famous Colleges and University buildings attract visitors from all over the world. \nBut the University's museums and collections also hold many treasures which give an exciting insight into some of the scholarly activities, both past and present, of the University's academics and students.\n\nEducation\n\nResearch students may have the opportunity to gain supervising and demonstrating experience by undertaking teaching on behalf of Colleges and departments. Supervisions involve the teaching of undergraduates in small groups of between one and four students at regular intervals throughout the term.\n Demonstrating involves helping academic staff in running laboratory classes and various teaching exercises such as drawing or computer-aided process engineering. Such experience can be immensely valuable in developing a wide range of transferrable skills which can be important for future career success, whether in academia or in other fields.\n\nResearch\n\nWe seek to provide a creative and supportive environment in which ideas are generated and can flourish. \nThe excellence and diversity of our research across the Schools of Arts & Humanities, Humanities & Social Sciences, Clinical Medicine, Technology, Physical Sciences and Biological Sciences, and our role as one of the founder members of the Cambridge Network, means that in addition to our achievements in fundamental research, we are also well-positioned to make significant contributions to the global innovation agenda and, by conveying the implications of our research, to contribute to the formulation of policy.\n\nCareer\n\nThe 2019 Cambridge Careers Guide is packed with practical advice and information on employers targeting University of Cambridge students.\nThe Guide is sent to all colleges at the start of Michaelmas Term. Ask your porters if you are not sure where the Guides are in your college, or you can collect a free copy from the Careers Service.\n\nOverview\nScholarships\nUniversities ranking\nServices\nStudent Life\nGlobal Student Satisfaction Awards 2023\n\nThe Global Student Satisfaction Awards empower students across the globe to determine the best universities of 2023. Universities with a score above 4.0 (out of 5) in any of the 8 award categories, receive Badges of Excellence. Congratulations!\n\nLearn more about the Global Student Satisfaction Awards\nStudent insurance\n\nMake sure to cover your health, travel, and stay while studying abroad. Even global coverages can miss important items, so make sure your student insurance ticks all the following:\n\nAdditional medical costs (i.e. dental)\nRepatriation, if something happens to you or your family\nLiability\nHome contents and baggage\nAccidents\nLegal aid\n\nWe partnered with Aon to provide you with the best affordable student insurance, for a carefree experience away from home.\n\nGet your student insurance now\n\nStarting from €0.53/day, free cancellation any time.\n\nRemember, countries and universities may have specific insurance requirements. To learn more about how student insurance work at University of Cambridge and/or in your country of interest, please visit Student Insurance Portal.\n\nWin a €10,000 Scholarship!\n\nEmbark on your journey with the Studyportals Scholarship! We're giving away a total of 20,000 euros to help you achieve your dream of studying abroad.\n\nApply for Scholarship\nPass IELTS with Swoosh English\nFeatured \n\nAccelerate your IELTS preparation by taking a course designed by experts to get you the result you need and get an exclusive Studyportals discount!\n\nClaim your 25% discount now\nStudent Reviews\nComprehensive A-level science courses: rigorous.\nAnonymous rated 5 out of 5 stars\n\nChallenging , rewarding, and enlightening journey.\n\nThe Way of Life in Cambridge\nAnonymous rated 4 out of 5 stars\n\nThe academic side of the University is excellent but I am struggling with the financial situation here.\n\nCambridge Univesity EXP+1!\nAnonymous rated 4 out of 5 stars\n\nExcellent academic facilities but lack of individual support\n\nRead 50 reviews\nCambridge, England, United Kingdom\nGet More Information About United Kingdom\nOther programmes from this organisation\n134\nShort Courses\n83\nOnline Courses\n75\nPhDs\n Find More Masters\nUniversity of Cambridge\nFind More Masters\nImprove page content\n \n \n \n \nTop\nAbout Studyportals\nAbout Studyportals\nAI Student Advisor\nOur Marketing Services\nCareers\nContact us\nOur websites\nBachelorsportal\nMastersportal\nPhDportal\nDistanceLearningportal\nShortCoursesportal\nAdmissionTestportal\nEnglishTestportal\nStudentInsuranceportal\nNationality & currency\nPK\nPKR\nFollow us\nAdd to home screen\nTerms of Use\nPrivacy & Cookie statement\nDisclaimer\nCrafted with  by our team of 35 nationalities Copyright © 2007–2024 Studyportals B.V.\nCheck recommended programmes\n\nGo to your profile page to get personalised recommendations!",
      "tables": []
    }
  }