{
    "pageContent": {
      "text": "Explore\nDecide\nApply\nWishlist\nChat\nSign in\nImperial\nHome Countries United Kingdom Imperial\n4.2\n76\nRead 67 reviews\n Multiple locations\nImperial graduates are respected throughout the world. Imperial is ranked: • One of the world's top 10 universities in the QS World University Rankings 2015/16 and The Times Higher Education World University Rankings 2015/16 • 3rd in The Times and Sunday Times Good University Guide 2016 list of the UK's best universities\n#2\nRanking\n190\nMasters\n41\nScholarships\n8,000\nAcademic Staff\n17,000\nStudents\n10,540\nStudents (int'l)\nPublic\nInstitution Type\nMaster's Programmes\nNatural Sciences & Mathematics\nEngineering & Technology\nBusiness & Management\nMedicine & Health\nComputer Science & IT\nEnvironmental Studies & Earth Sciences\nArts, Design & Architecture\nSocial Sciences\nEducation & Training\nJournalism & Media\nAgriculture & Forestry\nApplied Sciences & Professions\nHospitality, Leisure & Sports\nHumanities\nAdvanced Chemical Engineering\nM.Sc. / Full-time / On campus\nImperial\nLondon, United Kingdom\n15,222,638 PKR / year\n1 year\nAdvanced Chemical Engineering with Biotechnology\nM.Sc. / Full-time / On campus\nImperial\nLondon, United Kingdom\n15,222,638 PKR / year\n1 year\nAdvanced Chemical Engineering with Process Systems Engineering\nM.Sc. / Full-time / On campus\nImperial\nLondon, United Kingdom\n15,222,638 PKR / year\n1 year\nAdvanced Computational Methods for Aeronautics, Flow Management and Fluid-Structure Interaction\nM.Sc. / Full-time / On campus\nImperial\nLondon, United Kingdom\n15,222,638 PKR / year\n1 year\nShow more programmes\nHistory\n\nIn 1898, the 1851 Commission offered the land opposite the Imperial Institute, valued at £100,000 if government funding was made available for construction of the building. The architect for the Royal College of Science building was Sir Aston Webb and was completed in 1906.\n\nEducation\n\nImperial embodies and delivers world class scholarship, education and research in science, engineering and medicine, with particular regard to their application in industry, commerce and healthcare. They foster interdisciplinary working internally and collaborate widely externally.\n\nResearch\n\nImperial is a world class university with expertise in many areas of engineering, science, medicine and business. Based at and owned by Imperial, and with access to over 3,000 academic and research staff, Imperial Consultants is well placed to help your organisation find the right expertise and skills to address your challenges.Research Services in faculties:\n\nResponsible for the integrity of research proposals after they have been costed and checked by the Principal Investigator's (PI) department or division\nAssist the PI in developing a price\nHave final authorisation of all research proposals\nAdminister all grants and contracts following award and acceptance\nProvide support and advice in research management\n\nCareer\n\nCareer planning\n\nAlthough everyone's situation is unique, there are some key steps to take in order to develop and progress your career. Start this process early and you will save yourself time later - the process continues as your career develops too!Successful career planning starts early - it's a good idea to make a start during your first year. When trying to make career choices, you need to have a good understanding of yourself, your options, and how you usually make decisions. You also need to think about any constraints that you need to take into consideration.\n\nOverview\nScholarships\nUniversities ranking\nServices\nStudent Life\nGlobal Student Satisfaction Awards 2023\n\nThe Global Student Satisfaction Awards empower students across the globe to determine the best universities of 2023. Universities with a score above 4.0 (out of 5) in any of the 8 award categories, receive Badges of Excellence. Congratulations!\n\nLearn more about the Global Student Satisfaction Awards\nStudent insurance\n\nMake sure to cover your health, travel, and stay while studying abroad. Even global coverages can miss important items, so make sure your student insurance ticks all the following:\n\nAdditional medical costs (i.e. dental)\nRepatriation, if something happens to you or your family\nLiability\nHome contents and baggage\nAccidents\nLegal aid\n\nWe partnered with Aon to provide you with the best affordable student insurance, for a carefree experience away from home.\n\nGet your student insurance now\n\nStarting from €0.53/day, free cancellation any time.\n\nRemember, countries and universities may have specific insurance requirements. To learn more about how student insurance work at Imperial and/or in United Kingdom, please visit Student Insurance Portal.\n\nWin a €10,000 Scholarship!\n\nEmbark on your journey with the Studyportals Scholarship! We're giving away a total of 20,000 euros to help you achieve your dream of studying abroad.\n\nApply for Scholarship\nPass IELTS with Swoosh English\nFeatured \n\nAccelerate your IELTS preparation by taking a course designed by experts to get you the result you need and get an exclusive Studyportals discount!\n\nClaim your 25% discount now\nStudent Reviews\nA PhD student at Imperial\nAnonymous rated 5 out of 5 stars\n\nI just started my Ph.D. two weeks ago and have no particular experience to share. My first impression is that everything looks organized.\n\nChallenging yet rewarding and impersonal\nAnonymous rated 4 out of 5 stars\n\nImperial is a world renowned research institution boasting challenging courses where you will learn practical skills and deepen your knowledge. Perfect for students looking for a challenge. However, I find that your experience at Imperial is entirely course dependent. I am in a department that is has great communication between professors, and between the staff and...\n\nHighlight is the connections I have made.\nAnonymous rated 4 out of 5 stars\n\nI really enjoy the diversity of opportunities available at my university. The academic programs are excellent and offer a wide range of disciplines to choose from. Additionally, the professors are knowledgeable and approachable, and the resources available to students, such as the library and the computer lab, are top-notch. I also appreciate the many extracurricular...\n\nRead 67 reviews\nLondon, England, United Kingdom\nGet More Information About United Kingdom\nOther programmes from this organisation\n107\n(Pre-)Bachelors\n26\nPhDs\n25\nOnline Courses\n Find More Masters\nImperial\nFind More Masters\nImprove page content\n \n \n \n \nTop\nAbout Studyportals\nAbout Studyportals\nAI Student Advisor\nOur Marketing Services\nCareers\nContact us\nOur websites\nBachelorsportal\nMastersportal\nPhDportal\nDistanceLearningportal\nShortCoursesportal\nAdmissionTestportal\nEnglishTestportal\nStudentInsuranceportal\nNationality & currency\nPK\nPKR\nFollow us\nAdd to home screen\nTerms of Use\nPrivacy & Cookie statement\nDisclaimer\nCrafted with  by our team of 35 nationalities Copyright © 2007–2024 Studyportals B.V.\nCheck recommended programmes\n\nGo to your profile page to get personalised recommendations!",
      "tables": []
    }
  }