[
  {
    "text": "Skip to main content\nView accessibility support page\nSearch\nMenu\nCourse search\nCourse compare\n1\nFind a course\nChoose a study type:\nUndergraduate\nPostgraduate taught\nPostgraduate doctoral\nOnline\nSearch by keyword:\nSearch\nRefine your results\nHide filters\nSubject\nStart year\n\nShowing 169 results\n\npostgraduate taught\nClear Filters\nPostgraduate taught\nMSc\nCompare\nAdvanced Aeronautical Engineering\n\nWork with the latest industry-standard software in a world-leading research department.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering\n\nUndertake advanced study in chemical engineering and enhance your knowledge of basic sciences, mathematics and computing.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering with Biotechnology\n\nGain a firm foundation in the science and engineering of biological processes.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering with Process Systems Engineering\n\nDevelop an understanding of the mathematics relevant to systems engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Computational Methods for Aeronautics, Flow Management and Fluid-Structure Interaction\n\nDevelop specialist computational knowledge for a career in aerospace or engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Computing\n\nStudy a range of advanced computing concepts and technologies alongside experts in the field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Materials for Sustainable Infrastructure\n\nLearn about the behaviour and characteristics of civil engineering materials in depth.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Materials Science and Engineering\n\nSpecialise in materials for energy transition and develop your passion for exploring and creating innovative materials.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Mechanical Engineering\n\nBroaden your knowledge of key areas of mechanical engineering and explore recent developments in the field.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nAdvanced Molecular Synthesis\n\nDevelop skills in synthetic chemistry with a focus on approaches to automate, analyse and understand synthetic processes.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nAllergy (MSc)\n\nDevelop the advanced knowledge and practical skills to optimally diagnose and manage allergic diseases.\n\nStudy options\nAllergy (PG Dip)\nAllergy (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAnalogue and Digital Integrated Circuit Design\n\nGain experience in the practical issues of device-level design and system-level performance requirements.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Biosciences and Biotechnology\n\nGain an in-depth understanding of modern bioscience research and acquire the skills needed to pursue a career in the field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Computational Science and Engineering\n\nDiscover how numerical methods and computational science can help solve large scale problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Genomics\n\nLearn how big data and experimental research can be harnessed to revolutionise biological sciences and biomedicine.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Machine Learning\n\nLearn how to design, implement and evaluate machine learning systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Mathematics\n\nEquipping students with a range of transferable skills in mathematical modelling, analysis and computation for employment in industry and future research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Paediatrics (MSc)\n\nAdvance your understanding of the scientific and evidence base of paediatrics\n\nStudy options\nApplied Paediatrics (PG Cert)\nApplied Paediatrics (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nArtificial Intelligence\n\nReceive intensive training in programming and the fundamentals of artificial intelligence.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nArtificial Intelligence and Machine Learning\n\nDevelop advanced artificial intelligence and machine learning skills and apply these to real-world problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nArtificial Intelligence Applications and Innovation\n\nLearn AI fundamentals, explore real-world AI applications, and acquire expertise needed to become a leader in AI technologies and business\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBioengineering\n\nDevelop analytical and problem solving skills for a career in bioengineering.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBioinformatics and Theoretical Systems Biology\n\nGain the skills to produce effective research in bioinformatics and theoretical systems biology\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiological and Physical Chemistry\n\nDevelop the skills to tackle the multidisciplinary problems that lie between life sciences and physical sciences.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Biomaterials)\n\nExplore the use of advanced biomaterials in medical and surgical environments.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Biomechanics and Mechanobiology)\n\nFocus on bioengineering problems related to systems to understand how mechanical forces impact biological function.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Computational Bioengineering)\n\nApply mathematical models and techniques to biological data to improve our understanding of how organisms function and how diseases progress.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Medical Physics)\n\nExplore methods, techniques and applications for the monitoring and imaging of biological systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Neurotechnology)\n\nDevelop expertise in the science and technology related to nervous systems, brains function and devices in neurotechnology.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Anaesthetics, Pain Medicine and Intensive Care)\n\nExplore the principles of molecular mechanisms and study advanced physiology and pharmacology of anaesthetics, pain medicine and intensive care.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Bacterial Pathogenesis and Infection)\n\nTraining in the fundamental aspects of bacterial pathogenesis for a career in biomedical research.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Data Science)\n\nInterdisciplinary training in 'big data' analysis, building skills towards a career in biomedical research.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Epidemiology, Evolution and Control of Infectious Diseases)\n\nSpecialise in biomedical research within the field of epidemiology, evolution and the control of infectious diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (General Biomedical Research)\n\nPrepare for a career in biomedical research and discover advanced practical techniques used in experimental and human biomedical sciences.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Microbiome in Health and Disease)\n\nDevelop your biomedical research expertise and explore multidisciplinary approaches to understanding the gut microbiome.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Molecular Basis of Human Disease)\n\nTrain for a career in biomedical research and specialise in molecular mechanisms and structural biology.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Respiratory and Cardiovascular Science)\n\nGain fundamental skills towards a career in biomedical research and build your knowledge of the basic physiology of cardiac function.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiosystematics\n\nBroaden your understanding of taxonomy and systematics and gain practical experience in the field\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBusiness Analytics\n\nLearn how to apply the latest academic thinking and analytical and computing tools to help make business decisions.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nBusiness Analytics (Online)\n\nDrive business transformation through data-driven decision making.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology\n\nExplore advanced technology and approaches used in cancer biology and undertake training towards a research career.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology (Cancer Informatics)\n\nReceive world-class training in research at the interface of computational and clinical translational science.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology (Cancer Innovation)\n\nLearn to tackle biological and medical challenges in cancer, with a focus on translating cutting edge bio- and deep-tech research from concept to application.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Technology\n\nDevelop a unique understanding of cancer from a bioengineering perspective.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCardiovascular and Respiratory Healthcare (MSc)\n\nDeepen your knowledge in cardiovascular and respiratory healthcare and develop skills towards your chosen career field.\n\nStudy options\nCardiovascular and Respiratory Healthcare (PG Dip)\nCardiovascular and Respiratory Healthcare (PG Cert)\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCatalysis: Chemistry and Engineering\n\nAdvance your understanding of chemical transformations and how to tackle challenges in the field of catalysis.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nChemical Biology and Bio-Entrepreneurship\n\nLearn the skills needed to address future scientific challenges in the emerging discipline of chemical biology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCleantech Innovation\n\nBecome a climate innovator and cleantech entrepreneur through this interdisciplinary MSc.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nClimate Change, Management and Finance\n\nLead the way in tackling the challenges of climate change and sustainability in business.\n\nStart date\n2025\nPostgraduate taught, Online\nMRes\nCompare\nClinical Research (Diabetes and Obesity) MRes\n\nReceive interdisciplinary training in diabetes and obesity research and build skills towards a career in clinical research.\n\nStudy options\nClinical Research (Diabetes and Obesity) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught, Online\nMRes\nCompare\nClinical Research (Human Nutrition) MRes\n\nReceive broad training and practical experience in designing, implementing and reporting clinical studies.\n\nStudy options\nClinical Research (Human Nutrition) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nClinical Research (Translational Medicine) MRes\n\nReceive broad training and practical experience in designing, implementing and reporting clinical studies.\n\nStudy options\nClinical Research (Translational Medicine) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCommunications and Signal Processing\n\nDevelop an in-depth knowledge of modern information engineering problems and their solutions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComposites – the Science, Technology and Engineering Application of Advanced Composites\n\nExplore how high performance composite materials are increasingly important in the production of aircraft.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing\n\nDeepen your understanding and knowledge of computer science to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Artificial Intelligence and Machine Learning)\n\nDeepen your knowledge and understanding of artificial intelligence and machine learning to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Management and Finance)\n\nSpecialise in the management of software development and the application of software technology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Security and Reliability)\n\nEnhance your knowledge of IT security and reliability to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Software Engineering)\n\nSpecialise in the application of engineering to the design, development, and maintenance of software.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Visual Computing and Robotics)\n\nSpecialise in the study of vision, graphics, intelligent behaviour and biomedical image computing.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nConcrete Structures\n\nLearn to design, analyse and assess concrete structures such as bridges and buildings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nConservation Science and Practice\n\nLearn to lead conservation programmes to tackle global biodiversity challenges based on conservation science practice\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nControl and Optimisation\n\nStudy aspects of control theory and optimisation and their application to the design of automated systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDesign Engineering\n\nCreate innovative products, systems, or solutions through an interdisciplinary approach in engineering, design, and entrepreneurship.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nDesign Engineering Research\n\nDevelop transdisciplinary research skills in Design Engineering and apply these to societal problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDesign with Behaviour Science\n\nLearn how to apply behavioural insights to the design of human-centred products and strategies.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDigital Chemistry with AI and Automation (MSc)\n\nDiscover how advances in automation, artificial intelligence, and big data are revolutionising the study of chemistry.\n\nStudy options\nDigital Chemistry with AI and Automation (PG Cert)\nStart date\n2025\nPostgraduate taught\nPG Dip\nCompare\nDigital Health Leadership (PG Dip)\n\nReceive world-class training towards a career as a digital health leader on the flagship programme of the NHS Digital Academy.\n\nStudy options\nDigital Health Leadership (MSc)\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nDrug Discovery and Development: Multidisciplinary Science for Next Generation Therapeutics\n\nBuild your expertise in multidisciplinary drug discovery research and explore emerging technologies.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEarthquake Engineering\n\nLearn to analyse, design and assess structures under seismic action and extreme conditions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEconomics and Strategy for Business\n\nPrepare for a successful career in specialist economic and management consultancies and financial services.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEngineering Fluid Mechanics for the Offshore, Coastal and Built Environments\n\nGain hands-on experience in fluid mechanics, as well as theoretical knowledge\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEngineering for Biomedicine\n\nLearn how to tackle modern healthcare challenges with bioengineering technology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Data Science and Machine Learning\n\nApply computing techniques and machine learning to real-world environmental problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Engineering\n\nAnalyse the principles and practices needed to protect the environment and human health.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Engineering with Data Science\n\nExplore environmental engineering practices and the use of computational methods and statistical modelling techniques.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Technology\n\nExplore the tools, alternative technologies and policies of sustainable environmental management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEpidemiology (MSc)\n\nApply statistical and mathematical methods to epidemiological investigations, to inform public health practice.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nExecutive MBA\n\nMaximise your leadership potential without taking time away from your career.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nExperimental Neuroscience\n\nReceive broad research training in neuroscience to prepare for further PhD study or a career in clinical service.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinance\n\nBecome a leader in the financial sector.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinance and Accounting\n\nBecome a leader in the financial sector.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinancial Technology\n\nLead innovation in financial technology.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nFull-Time MBA\n\nAn accelerated career pathway to responsible business leadership.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFuture Power Networks\n\nDeepen your understanding of operating practice, design standards and regulatory policies in the electricity supply industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeneral Structural Engineering\n\nExplore the broad spectrum of structural engineering issues affecting civil engineering structures.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeneral Structural Engineering with Data Science\n\nExplore the broad spectrum of structural engineering issues affecting civil engineering structures.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGenes, Drugs and Stem Cells – Novel Therapies (MSc)\n\nReceive a state-of-the-art education in next-generation therapies and build your expertise in translational research\n\nStudy options\nGenes, Drugs and Stem Cells - Novel Therapies (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGenomic Medicine (MSc)\n\nAcquire the knowledge and skills to be able to interpret and understand genomic data across a range of settings.\n\nStudy options\nGenomic Medicine (PG Dip)\nGenomic Medicine (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeo-Energy with Machine Learning and Data Science\n\nDevelop the essential data science and machine learning skills needed to embark on a career as a geoscientist or engineer.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Earthquake Engineering\n\nBuild your understanding of the theory of geomechanics and key concepts of engineering seismology\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Geoenvironmental Engineering\n\nObtain a solid technical basis in key areas of soil mechanics and apply that knowledge to aspects of environmental geotechnics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Geological Engineering\n\nSpecialise in key aspects of engineering geology and explore the fundamentals of geomechanics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering\n\nExamine the theory of geomechanics and explore the properties of soils and soft rocks.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering with Data Science\n\nStudy key areas of geotechnical engineering and specialise in analysing large volumes of geotechnical data to provide efficient, sustainable, resilient geotechnical solutions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering with Offshore Renewables\n\nSpecialise in the mechanics and engineering in the growing sector of offshore renewable energy\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGlobal Health Management\n\nEmpowering future leaders and critical thinkers to tackle global health challenges\n\nStart date\n2025\nPostgraduate taught, Online\nMBA\nCompare\nGlobal Online MBA\n\nGain your MBA from anywhere in the world.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nGreen Chemistry, Energy and the Environment\n\nAcquire the skills and experience required to thrive in the field of green chemistry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealth Data Analytics and Machine Learning (MSc)\n\nDevelop skills in using cutting-edge quantitative methods to fully exploit complex data.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealth Policy (MSc)\n\nGain a detailed understanding of health policy guided by international academics and practitioners.\n\nStudy options\nHealth Policy (PG Cert)\nHealth Policy (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealthcare and Design\n\nGain the tools to instigate and lead innovation in healthcare systems, services and spaces.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHuman and Biological Robotics\n\nAdvance your knowledge on how bioengineers are leading the way in tackling modern healthcare challenges.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHuman Molecular Genetics\n\nTrain in the theory and application of human genetics to prepare for a research career.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHydrology and Water Resources Management\n\nDiscover the theoretical background and practical design considerations of hydrology and water resources management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nImmunology (MSc)\n\nGain the knowledge, creativity and critical thinking skills to prepare for a career as a researcher in immunology.\n\nStudy options\nImmunology (PG Cert)\nStart date\n2025\nPostgraduate taught\nMA/MSc\nCompare\nInnovation Design Engineering\n\nDevelop the skills required to become a leader in creative, entrepreneurial design.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nInnovation, Entrepreneurship and Management\n\nGain the skills to create, deliver and capture value from innovation.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nInvestment and Wealth Management\n\nBecome a leader in the financial sector with CFA affiliation.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Computational Methods in Ecology and Evolution\n\nBring cutting-edge quantitative methods and biological concepts together to solve research problems.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Computational Methods in Ecology and Evolution\n\nUndergo intensive training in cutting-edge biological research and further your knowledge of quantitative techniques.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Ecological Applications\n\nReceive theoretical and hands-on training in the application of ecological and evolutionary science.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Ecology, Evolution and Conservation\n\nTrain in ecology, evolution and conservation concepts and study their applications to biodiversity.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Ecology, Evolution and Conservation Research\n\nObtain the interdisciplinary research skills required to succeed in the fields of ecology, evolution and conservation.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Ecosystems and Environmental Change\n\nStudy the latest developments in the conservation of ecosystems and the environment and build interdisciplinary skills.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMachine Learning and Big Data in the Physical Sciences\n\nDeepen your understanding of the methodologies used in research involving large data sets.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nMachine Learning and Data Science (Online)\n\nDevelop an in-depth understanding of machine learning models and learn to apply them to real-world problems.\n\nStart date\n2025\nPostgraduate taught\nMPH\nCompare\nMaster of Public Health (MPH)\n\nDevelop key quantitative analytical skills for a career in public health, epidemiology and health services research.\n\nStart date\n2025\nPostgraduate taught, Online\nMPH\nCompare\nMaster of Public Health (Online)\n\nResearch the world’s most pressing public health issues through a flexible online degree.\n\nStudy options\nGlobal Postgraduate Certificate of Public Health (Online)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMathematics and Finance\n\nBroaden your knowledge of mathematics and quantitative finance for a career in the financial services sector.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Device Design and Entrepreneurship\n\nDevelop research and analytical skills towards a career in bioengineering or for further PHD study.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Robotics and Image-Guided Intervention\n\nGain the research experience required to work within the innovative field of medical robotics and surgical imaging\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Robotics and Image-Guided Intervention: Clinical Robotics and AI\n\nDiscover how medical robotics and data science are being applied in the clinic and carry out cutting-edge translational research\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMedical Ultrasound (Echocardiography)\n\nDevelop the research and development skills required to specialise in the field of echocardiography.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMedical Ultrasound (Vascular)\n\nBuild your research and development skills in medical ultrasound and specialise in vascular ultrasound.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMetals and Energy Finance\n\nDeepen your understanding of the technical and financial assessment of natural energy and mineral resources.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular and Cellular Biosciences\n\nDevelop the fundamental skills needed for a career in biosciences research or academia.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMolecular Biology and Pathology of Viruses\n\nAnalyse the nature of viruses as cellular parasites and their importance in human, animal and plant diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular Engineering\n\nDevelop the cross-disciplinary expertise to work on exciting challenges at the interface of science and engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMolecular Medicine\n\nReceive theoretical and practical training using state-of-the-art techniques in molecular and cellular biology as applied to medicine.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular Plant and Microbial Sciences\n\nStudy advanced concepts and technologies related to the molecular basis of plant and microbe functions.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMRes Business\n\nEmbark on an inspirational learning experience enabling you to lead research in your field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMSc Bioscience Futures: Communication, Innovation and Entrepreneurship\n\nBecome an agent for change in the biosciences by combining entrepreneurial, communication and commercialisation skills to address global challenges.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMSc in Management\n\nGain in-demand and real-world management skills.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNanomaterials\n\nDiscover how investment in nanotechnology is helping deliver major scientific and technological advances.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNanomedicine and Nanodiagnostics MRes\n\nInvestigate the unique properties of nanoscale materials for the treatment, detection, visualisation and prevention of diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNeurotechnology\n\nDevelop your expertise for a career at the interface between neuroscience and engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nOptics and Photonics\n\nDiscover why optics is of key importance to many industrial sectors on one of the College’s longest-established courses.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nPhotonics\n\nDevelop your interests and skills in photonics and be trained in research methods.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics\n\nBuild your physics knowledge to prepare for a research career within a university or national laboratory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics with Extended Research\n\nDeepen your knowledge of physics to prepare for a research career within a university or national laboratory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics with Quantum Dynamics\n\nDeepen your knowledge of quantum dynamics to prepare for a research career.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPure Mathematics\n\nObtain transferrable mathematical skills needed for employment and future research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nQuantum Fields and Fundamental Forces\n\nGain the skills you need to undertake future PhD study in fundamental theoretical physics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nRenewable Energy with AI and Data Science: Geology and Geophysics\n\nApply computational techniques to geological and geophysical data to characterise sites for renewable energy.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nReproductive and Developmental Biology (MSc)\n\nDevelop your skills for a scientific or clinical career in reproductive and developmental biology.\n\nStudy options\nReproductive and Developmental Biology (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nRisk Management and Financial Engineering\n\nBecome a leader in risk management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nScience Communication\n\nPrepare for a range of science communication careers through academic and practical experience.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nScience Media Production\n\nDevelop the expertise required to work in broadcast media television or radio.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSecurity and Resilience: Science and Technology (MSc)\n\nDeepen your understanding of the science and cutting-edge technologies that underpin global security.\n\nStudy options\nSecurity and Resilience (PG Cert)\nSecurity and Resilience (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSensor Systems Engineering\n\nLearn to develop complete sensor systems and networks.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nSoft Electronic Materials\n\nCreate and optimise new types of electronic materials and devices for a diverse range of applications.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics\n\nDiscover a diverse range of statistical tools, applications and methods.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Applied Statistics)\n\nAdvance your understanding of theoretical and applied statistics and explore the use of stats in a variety of settings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Biostatistics)\n\nDevelop your appreciation of statistical theory and methods and its relevance to biology and medicine.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Data Science)\n\nBuild familiarity with a wide range of data science techniques and their application in a variety of settings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Statistical Finance)\n\nDevelop and apply statistical theory and methods in a wide range of situations relevant to commerce and finance.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Theory and Methods)\n\nAdvance your understanding of statistical methods and their underlying theory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStrategic Marketing\n\nPrepare to lead a data-driven marketing team.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nStrategic Marketing (Online)\n\nPrepare to lead a data-driven marketing team in this online, part-time course.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nStructural Biology\n\nTrain in major structural biology techniques for a career in research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStructural Steel Design\n\nUnderstand the theory and practice of structural steel design.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSustainable Energy Futures\n\nGain the skills needed to join the next generation of leaders in the energy sector.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nSystems and Synthetic Biology\n\nHands-on experience in experimental biology and modelling to understand, predict and redesign biological pathways.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTaxonomy, Biodiversity and Evolution\n\nReceive broad training towards a career in biological diversity.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTranslational Neuroscience\n\nReceive the advanced training required to understand neurological disorders and develop better treatments.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTransport\n\nExplore the movement of people and goods to prepare for a career in operations, engineering or transport planning.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTransport with Data Science\n\nSpecialise in analysing large volumes of transport data and in developing models for efficient, sustainable, and resilient transport systems.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nWeekend MBA\n\nTake your executive skills to the next level, without impacting your career.\n\nStart date\n2025\nExplore courses by subject\nSubject areas\nPause motion\nUseful Links\nPopular links\nBlackboard\nContact the Service Desk\nJobs\nLibrary services\nOutlook email online\nFaculties\nEngineering\nMedicine\nNatural Sciences\nImperial College Business School\nDirectories\nAdmin and support services\nNetworks and Centres\nResearch groups\nSearch all staff\nPartners\nImperial College Academic Health Science Centre\nImperial College Health Partners\nImperial College Healthcare NHS Trust\nImperial Consultants\nCollege Information\nImperial College London\nAddress\n\nImperial College London\nSouth Kensington Campus\nLondon SW7 2AZ, UK\ntel: +44 (0)20 7589 5111\n\nFacebook\nX, formerly known as Twitter\nYouTube\nLinkedIn\nInstagram\nTikTok\nSite Information\nSitemap\nAccessibility\nModern slavery statement\nPrivacy notice\nUse of cookies\nReport incorrect content\nLog in\n\n© 2024 Imperial College London\n\nWe use cookies to maintain and analyse our website performance and for advertising purposes. Where cookies have been categorised as ‘strictly necessary’ they are required to keep the site working but where optional we would like your consent to use them. To find out more please see our:Cookie Policy\nCookies Settings Reject All Accept All Cookies",
    "tables": []
  },
  {
    "text": "Skip to main content\nView accessibility support page\nSearch\nMenu\nCourse search\nCourse compare\n2\nFind a course\nChoose a study type:\nUndergraduate\nPostgraduate taught\nPostgraduate doctoral\nOnline\nSearch by keyword:\nSearch\nRefine your results\nHide filters\nSubject\nStart year\n\nShowing 169 results\n\npostgraduate taught\nClear Filters\nPostgraduate taught\nMSc\nCompare\nAdvanced Aeronautical Engineering\n\nWork with the latest industry-standard software in a world-leading research department.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering\n\nUndertake advanced study in chemical engineering and enhance your knowledge of basic sciences, mathematics and computing.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering with Biotechnology\n\nGain a firm foundation in the science and engineering of biological processes.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Chemical Engineering with Process Systems Engineering\n\nDevelop an understanding of the mathematics relevant to systems engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Computational Methods for Aeronautics, Flow Management and Fluid-Structure Interaction\n\nDevelop specialist computational knowledge for a career in aerospace or engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Computing\n\nStudy a range of advanced computing concepts and technologies alongside experts in the field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Materials for Sustainable Infrastructure\n\nLearn about the behaviour and characteristics of civil engineering materials in depth.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Materials Science and Engineering\n\nSpecialise in materials for energy transition and develop your passion for exploring and creating innovative materials.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAdvanced Mechanical Engineering\n\nBroaden your knowledge of key areas of mechanical engineering and explore recent developments in the field.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nAdvanced Molecular Synthesis\n\nDevelop skills in synthetic chemistry with a focus on approaches to automate, analyse and understand synthetic processes.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nAllergy (MSc)\n\nDevelop the advanced knowledge and practical skills to optimally diagnose and manage allergic diseases.\n\nStudy options\nAllergy (PG Dip)\nAllergy (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nAnalogue and Digital Integrated Circuit Design\n\nGain experience in the practical issues of device-level design and system-level performance requirements.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Biosciences and Biotechnology\n\nGain an in-depth understanding of modern bioscience research and acquire the skills needed to pursue a career in the field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Computational Science and Engineering\n\nDiscover how numerical methods and computational science can help solve large scale problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Genomics\n\nLearn how big data and experimental research can be harnessed to revolutionise biological sciences and biomedicine.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Machine Learning\n\nLearn how to design, implement and evaluate machine learning systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Mathematics\n\nEquipping students with a range of transferable skills in mathematical modelling, analysis and computation for employment in industry and future research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nApplied Paediatrics (MSc)\n\nAdvance your understanding of the scientific and evidence base of paediatrics\n\nStudy options\nApplied Paediatrics (PG Cert)\nApplied Paediatrics (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nArtificial Intelligence\n\nReceive intensive training in programming and the fundamentals of artificial intelligence.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nArtificial Intelligence and Machine Learning\n\nDevelop advanced artificial intelligence and machine learning skills and apply these to real-world problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nArtificial Intelligence Applications and Innovation\n\nLearn AI fundamentals, explore real-world AI applications, and acquire expertise needed to become a leader in AI technologies and business\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBioengineering\n\nDevelop analytical and problem solving skills for a career in bioengineering.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBioinformatics and Theoretical Systems Biology\n\nGain the skills to produce effective research in bioinformatics and theoretical systems biology\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiological and Physical Chemistry\n\nDevelop the skills to tackle the multidisciplinary problems that lie between life sciences and physical sciences.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Biomaterials)\n\nExplore the use of advanced biomaterials in medical and surgical environments.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Biomechanics and Mechanobiology)\n\nFocus on bioengineering problems related to systems to understand how mechanical forces impact biological function.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Computational Bioengineering)\n\nApply mathematical models and techniques to biological data to improve our understanding of how organisms function and how diseases progress.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Medical Physics)\n\nExplore methods, techniques and applications for the monitoring and imaging of biological systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBiomedical Engineering (Neurotechnology)\n\nDevelop expertise in the science and technology related to nervous systems, brains function and devices in neurotechnology.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Anaesthetics, Pain Medicine and Intensive Care)\n\nExplore the principles of molecular mechanisms and study advanced physiology and pharmacology of anaesthetics, pain medicine and intensive care.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Bacterial Pathogenesis and Infection)\n\nTraining in the fundamental aspects of bacterial pathogenesis for a career in biomedical research.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Data Science)\n\nInterdisciplinary training in 'big data' analysis, building skills towards a career in biomedical research.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Epidemiology, Evolution and Control of Infectious Diseases)\n\nSpecialise in biomedical research within the field of epidemiology, evolution and the control of infectious diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (General Biomedical Research)\n\nPrepare for a career in biomedical research and discover advanced practical techniques used in experimental and human biomedical sciences.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Microbiome in Health and Disease)\n\nDevelop your biomedical research expertise and explore multidisciplinary approaches to understanding the gut microbiome.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Molecular Basis of Human Disease)\n\nTrain for a career in biomedical research and specialise in molecular mechanisms and structural biology.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiomedical Research (Respiratory and Cardiovascular Science)\n\nGain fundamental skills towards a career in biomedical research and build your knowledge of the basic physiology of cardiac function.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nBiosystematics\n\nBroaden your understanding of taxonomy and systematics and gain practical experience in the field\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nBusiness Analytics\n\nLearn how to apply the latest academic thinking and analytical and computing tools to help make business decisions.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nBusiness Analytics (Online)\n\nDrive business transformation through data-driven decision making.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology\n\nExplore advanced technology and approaches used in cancer biology and undertake training towards a research career.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology (Cancer Informatics)\n\nReceive world-class training in research at the interface of computational and clinical translational science.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Biology (Cancer Innovation)\n\nLearn to tackle biological and medical challenges in cancer, with a focus on translating cutting edge bio- and deep-tech research from concept to application.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCancer Technology\n\nDevelop a unique understanding of cancer from a bioengineering perspective.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCardiovascular and Respiratory Healthcare (MSc)\n\nDeepen your knowledge in cardiovascular and respiratory healthcare and develop skills towards your chosen career field.\n\nStudy options\nCardiovascular and Respiratory Healthcare (PG Dip)\nCardiovascular and Respiratory Healthcare (PG Cert)\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nCatalysis: Chemistry and Engineering\n\nAdvance your understanding of chemical transformations and how to tackle challenges in the field of catalysis.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nChemical Biology and Bio-Entrepreneurship\n\nLearn the skills needed to address future scientific challenges in the emerging discipline of chemical biology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCleantech Innovation\n\nBecome a climate innovator and cleantech entrepreneur through this interdisciplinary MSc.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nClimate Change, Management and Finance\n\nLead the way in tackling the challenges of climate change and sustainability in business.\n\nStart date\n2025\nPostgraduate taught, Online\nMRes\nCompare\nClinical Research (Diabetes and Obesity) MRes\n\nReceive interdisciplinary training in diabetes and obesity research and build skills towards a career in clinical research.\n\nStudy options\nClinical Research (Diabetes and Obesity) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught, Online\nMRes\nCompare\nClinical Research (Human Nutrition) MRes\n\nReceive broad training and practical experience in designing, implementing and reporting clinical studies.\n\nStudy options\nClinical Research (Human Nutrition) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nClinical Research (Translational Medicine) MRes\n\nReceive broad training and practical experience in designing, implementing and reporting clinical studies.\n\nStudy options\nClinical Research (Translational Medicine) Postgraduate Certificate\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nCommunications and Signal Processing\n\nDevelop an in-depth knowledge of modern information engineering problems and their solutions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComposites – the Science, Technology and Engineering Application of Advanced Composites\n\nExplore how high performance composite materials are increasingly important in the production of aircraft.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing\n\nDeepen your understanding and knowledge of computer science to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Artificial Intelligence and Machine Learning)\n\nDeepen your knowledge and understanding of artificial intelligence and machine learning to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Management and Finance)\n\nSpecialise in the management of software development and the application of software technology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Security and Reliability)\n\nEnhance your knowledge of IT security and reliability to prepare for a career in the computing industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Software Engineering)\n\nSpecialise in the application of engineering to the design, development, and maintenance of software.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nComputing (Visual Computing and Robotics)\n\nSpecialise in the study of vision, graphics, intelligent behaviour and biomedical image computing.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nConcrete Structures\n\nLearn to design, analyse and assess concrete structures such as bridges and buildings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nConservation Science and Practice\n\nLearn to lead conservation programmes to tackle global biodiversity challenges based on conservation science practice\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nControl and Optimisation\n\nStudy aspects of control theory and optimisation and their application to the design of automated systems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDesign Engineering\n\nCreate innovative products, systems, or solutions through an interdisciplinary approach in engineering, design, and entrepreneurship.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nDesign Engineering Research\n\nDevelop transdisciplinary research skills in Design Engineering and apply these to societal problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDesign with Behaviour Science\n\nLearn how to apply behavioural insights to the design of human-centred products and strategies.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nDigital Chemistry with AI and Automation (MSc)\n\nDiscover how advances in automation, artificial intelligence, and big data are revolutionising the study of chemistry.\n\nStudy options\nDigital Chemistry with AI and Automation (PG Cert)\nStart date\n2025\nPostgraduate taught\nPG Dip\nCompare\nDigital Health Leadership (PG Dip)\n\nReceive world-class training towards a career as a digital health leader on the flagship programme of the NHS Digital Academy.\n\nStudy options\nDigital Health Leadership (MSc)\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nDrug Discovery and Development: Multidisciplinary Science for Next Generation Therapeutics\n\nBuild your expertise in multidisciplinary drug discovery research and explore emerging technologies.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEarthquake Engineering\n\nLearn to analyse, design and assess structures under seismic action and extreme conditions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEconomics and Strategy for Business\n\nPrepare for a successful career in specialist economic and management consultancies and financial services.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEngineering Fluid Mechanics for the Offshore, Coastal and Built Environments\n\nGain hands-on experience in fluid mechanics, as well as theoretical knowledge\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEngineering for Biomedicine\n\nLearn how to tackle modern healthcare challenges with bioengineering technology.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Data Science and Machine Learning\n\nApply computing techniques and machine learning to real-world environmental problems.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Engineering\n\nAnalyse the principles and practices needed to protect the environment and human health.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Engineering with Data Science\n\nExplore environmental engineering practices and the use of computational methods and statistical modelling techniques.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEnvironmental Technology\n\nExplore the tools, alternative technologies and policies of sustainable environmental management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nEpidemiology (MSc)\n\nApply statistical and mathematical methods to epidemiological investigations, to inform public health practice.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nExecutive MBA\n\nMaximise your leadership potential without taking time away from your career.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nExperimental Neuroscience\n\nReceive broad research training in neuroscience to prepare for further PhD study or a career in clinical service.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinance\n\nBecome a leader in the financial sector.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinance and Accounting\n\nBecome a leader in the financial sector.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFinancial Technology\n\nLead innovation in financial technology.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nFull-Time MBA\n\nAn accelerated career pathway to responsible business leadership.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nFuture Power Networks\n\nDeepen your understanding of operating practice, design standards and regulatory policies in the electricity supply industry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeneral Structural Engineering\n\nExplore the broad spectrum of structural engineering issues affecting civil engineering structures.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeneral Structural Engineering with Data Science\n\nExplore the broad spectrum of structural engineering issues affecting civil engineering structures.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGenes, Drugs and Stem Cells – Novel Therapies (MSc)\n\nReceive a state-of-the-art education in next-generation therapies and build your expertise in translational research\n\nStudy options\nGenes, Drugs and Stem Cells - Novel Therapies (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGenomic Medicine (MSc)\n\nAcquire the knowledge and skills to be able to interpret and understand genomic data across a range of settings.\n\nStudy options\nGenomic Medicine (PG Dip)\nGenomic Medicine (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeo-Energy with Machine Learning and Data Science\n\nDevelop the essential data science and machine learning skills needed to embark on a career as a geoscientist or engineer.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Earthquake Engineering\n\nBuild your understanding of the theory of geomechanics and key concepts of engineering seismology\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Geoenvironmental Engineering\n\nObtain a solid technical basis in key areas of soil mechanics and apply that knowledge to aspects of environmental geotechnics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical and Geological Engineering\n\nSpecialise in key aspects of engineering geology and explore the fundamentals of geomechanics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering\n\nExamine the theory of geomechanics and explore the properties of soils and soft rocks.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering with Data Science\n\nStudy key areas of geotechnical engineering and specialise in analysing large volumes of geotechnical data to provide efficient, sustainable, resilient geotechnical solutions.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGeotechnical Engineering with Offshore Renewables\n\nSpecialise in the mechanics and engineering in the growing sector of offshore renewable energy\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nGlobal Health Management\n\nEmpowering future leaders and critical thinkers to tackle global health challenges\n\nStart date\n2025\nPostgraduate taught, Online\nMBA\nCompare\nGlobal Online MBA\n\nGain your MBA from anywhere in the world.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nGreen Chemistry, Energy and the Environment\n\nAcquire the skills and experience required to thrive in the field of green chemistry.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealth Data Analytics and Machine Learning (MSc)\n\nDevelop skills in using cutting-edge quantitative methods to fully exploit complex data.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealth Policy (MSc)\n\nGain a detailed understanding of health policy guided by international academics and practitioners.\n\nStudy options\nHealth Policy (PG Cert)\nHealth Policy (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHealthcare and Design\n\nGain the tools to instigate and lead innovation in healthcare systems, services and spaces.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHuman and Biological Robotics\n\nAdvance your knowledge on how bioengineers are leading the way in tackling modern healthcare challenges.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHuman Molecular Genetics\n\nTrain in the theory and application of human genetics to prepare for a research career.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nHydrology and Water Resources Management\n\nDiscover the theoretical background and practical design considerations of hydrology and water resources management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nImmunology (MSc)\n\nGain the knowledge, creativity and critical thinking skills to prepare for a career as a researcher in immunology.\n\nStudy options\nImmunology (PG Cert)\nStart date\n2025\nPostgraduate taught\nMA/MSc\nCompare\nInnovation Design Engineering\n\nDevelop the skills required to become a leader in creative, entrepreneurial design.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nInnovation, Entrepreneurship and Management\n\nGain the skills to create, deliver and capture value from innovation.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nInvestment and Wealth Management\n\nBecome a leader in the financial sector with CFA affiliation.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Computational Methods in Ecology and Evolution\n\nBring cutting-edge quantitative methods and biological concepts together to solve research problems.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Computational Methods in Ecology and Evolution\n\nUndergo intensive training in cutting-edge biological research and further your knowledge of quantitative techniques.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Ecological Applications\n\nReceive theoretical and hands-on training in the application of ecological and evolutionary science.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nLiving Planet with Ecology, Evolution and Conservation\n\nTrain in ecology, evolution and conservation concepts and study their applications to biodiversity.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Ecology, Evolution and Conservation Research\n\nObtain the interdisciplinary research skills required to succeed in the fields of ecology, evolution and conservation.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nLiving Planet with Ecosystems and Environmental Change\n\nStudy the latest developments in the conservation of ecosystems and the environment and build interdisciplinary skills.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMachine Learning and Big Data in the Physical Sciences\n\nDeepen your understanding of the methodologies used in research involving large data sets.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nMachine Learning and Data Science (Online)\n\nDevelop an in-depth understanding of machine learning models and learn to apply them to real-world problems.\n\nStart date\n2025\nPostgraduate taught\nMPH\nCompare\nMaster of Public Health (MPH)\n\nDevelop key quantitative analytical skills for a career in public health, epidemiology and health services research.\n\nStart date\n2025\nPostgraduate taught, Online\nMPH\nCompare\nMaster of Public Health (Online)\n\nResearch the world’s most pressing public health issues through a flexible online degree.\n\nStudy options\nGlobal Postgraduate Certificate of Public Health (Online)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMathematics and Finance\n\nBroaden your knowledge of mathematics and quantitative finance for a career in the financial services sector.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Device Design and Entrepreneurship\n\nDevelop research and analytical skills towards a career in bioengineering or for further PHD study.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Robotics and Image-Guided Intervention\n\nGain the research experience required to work within the innovative field of medical robotics and surgical imaging\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMedical Robotics and Image-Guided Intervention: Clinical Robotics and AI\n\nDiscover how medical robotics and data science are being applied in the clinic and carry out cutting-edge translational research\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMedical Ultrasound (Echocardiography)\n\nDevelop the research and development skills required to specialise in the field of echocardiography.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMedical Ultrasound (Vascular)\n\nBuild your research and development skills in medical ultrasound and specialise in vascular ultrasound.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMetals and Energy Finance\n\nDeepen your understanding of the technical and financial assessment of natural energy and mineral resources.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular and Cellular Biosciences\n\nDevelop the fundamental skills needed for a career in biosciences research or academia.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMolecular Biology and Pathology of Viruses\n\nAnalyse the nature of viruses as cellular parasites and their importance in human, animal and plant diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular Engineering\n\nDevelop the cross-disciplinary expertise to work on exciting challenges at the interface of science and engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMolecular Medicine\n\nReceive theoretical and practical training using state-of-the-art techniques in molecular and cellular biology as applied to medicine.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMolecular Plant and Microbial Sciences\n\nStudy advanced concepts and technologies related to the molecular basis of plant and microbe functions.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nMRes Business\n\nEmbark on an inspirational learning experience enabling you to lead research in your field.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMSc Bioscience Futures: Communication, Innovation and Entrepreneurship\n\nBecome an agent for change in the biosciences by combining entrepreneurial, communication and commercialisation skills to address global challenges.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nMSc in Management\n\nGain in-demand and real-world management skills.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNanomaterials\n\nDiscover how investment in nanotechnology is helping deliver major scientific and technological advances.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNanomedicine and Nanodiagnostics MRes\n\nInvestigate the unique properties of nanoscale materials for the treatment, detection, visualisation and prevention of diseases.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nNeurotechnology\n\nDevelop your expertise for a career at the interface between neuroscience and engineering.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nOptics and Photonics\n\nDiscover why optics is of key importance to many industrial sectors on one of the College’s longest-established courses.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nPhotonics\n\nDevelop your interests and skills in photonics and be trained in research methods.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics\n\nBuild your physics knowledge to prepare for a research career within a university or national laboratory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics with Extended Research\n\nDeepen your knowledge of physics to prepare for a research career within a university or national laboratory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPhysics with Quantum Dynamics\n\nDeepen your knowledge of quantum dynamics to prepare for a research career.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nPure Mathematics\n\nObtain transferrable mathematical skills needed for employment and future research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nQuantum Fields and Fundamental Forces\n\nGain the skills you need to undertake future PhD study in fundamental theoretical physics.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nRenewable Energy with AI and Data Science: Geology and Geophysics\n\nApply computational techniques to geological and geophysical data to characterise sites for renewable energy.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nReproductive and Developmental Biology (MSc)\n\nDevelop your skills for a scientific or clinical career in reproductive and developmental biology.\n\nStudy options\nReproductive and Developmental Biology (PG Cert)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nRisk Management and Financial Engineering\n\nBecome a leader in risk management.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nScience Communication\n\nPrepare for a range of science communication careers through academic and practical experience.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nScience Media Production\n\nDevelop the expertise required to work in broadcast media television or radio.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSecurity and Resilience: Science and Technology (MSc)\n\nDeepen your understanding of the science and cutting-edge technologies that underpin global security.\n\nStudy options\nSecurity and Resilience (PG Cert)\nSecurity and Resilience (PG Dip)\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSensor Systems Engineering\n\nLearn to develop complete sensor systems and networks.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nSoft Electronic Materials\n\nCreate and optimise new types of electronic materials and devices for a diverse range of applications.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics\n\nDiscover a diverse range of statistical tools, applications and methods.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Applied Statistics)\n\nAdvance your understanding of theoretical and applied statistics and explore the use of stats in a variety of settings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Biostatistics)\n\nDevelop your appreciation of statistical theory and methods and its relevance to biology and medicine.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Data Science)\n\nBuild familiarity with a wide range of data science techniques and their application in a variety of settings.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Statistical Finance)\n\nDevelop and apply statistical theory and methods in a wide range of situations relevant to commerce and finance.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStatistics (Theory and Methods)\n\nAdvance your understanding of statistical methods and their underlying theory.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStrategic Marketing\n\nPrepare to lead a data-driven marketing team.\n\nStart date\n2025\nPostgraduate taught, Online\nMSc\nCompare\nStrategic Marketing (Online)\n\nPrepare to lead a data-driven marketing team in this online, part-time course.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nStructural Biology\n\nTrain in major structural biology techniques for a career in research.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nStructural Steel Design\n\nUnderstand the theory and practice of structural steel design.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nSustainable Energy Futures\n\nGain the skills needed to join the next generation of leaders in the energy sector.\n\nStart date\n2025\nPostgraduate taught\nMRes\nCompare\nSystems and Synthetic Biology\n\nHands-on experience in experimental biology and modelling to understand, predict and redesign biological pathways.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTaxonomy, Biodiversity and Evolution\n\nReceive broad training towards a career in biological diversity.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTranslational Neuroscience\n\nReceive the advanced training required to understand neurological disorders and develop better treatments.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTransport\n\nExplore the movement of people and goods to prepare for a career in operations, engineering or transport planning.\n\nStart date\n2025\nPostgraduate taught\nMSc\nCompare\nTransport with Data Science\n\nSpecialise in analysing large volumes of transport data and in developing models for efficient, sustainable, and resilient transport systems.\n\nStart date\n2025\nPostgraduate taught\nMBA\nCompare\nWeekend MBA\n\nTake your executive skills to the next level, without impacting your career.\n\nStart date\n2025\nExplore courses by subject\nSubject areas\nPause motion\nUseful Links\nPopular links\nBlackboard\nContact the Service Desk\nJobs\nLibrary services\nOutlook email online\nFaculties\nEngineering\nMedicine\nNatural Sciences\nImperial College Business School\nDirectories\nAdmin and support services\nNetworks and Centres\nResearch groups\nSearch all staff\nPartners\nImperial College Academic Health Science Centre\nImperial College Health Partners\nImperial College Healthcare NHS Trust\nImperial Consultants\nCollege Information\nImperial College London\nAddress\n\nImperial College London\nSouth Kensington Campus\nLondon SW7 2AZ, UK\ntel: +44 (0)20 7589 5111\n\nFacebook\nX, formerly known as Twitter\nYouTube\nLinkedIn\nInstagram\nTikTok\nSite Information\nSitemap\nAccessibility\nModern slavery statement\nPrivacy notice\nUse of cookies\nReport incorrect content\nLog in\n\n© 2024 Imperial College London\n\nWe use cookies to maintain and analyse our website performance and for advertising purposes. Where cookies have been categorised as ‘strictly necessary’ they are required to keep the site working but where optional we would like your consent to use them. To find out more please see our:Cookie Policy\nCookies Settings Reject All Accept All Cookies",
    "tables": []
  }
]